package day12;

public class Example01 {
    public static void main(String[] args) {
        /*
        * 상속
        * - 부모 클래스가 가진 기능을 자식 클래스에서 사용할 수 있다.
        * - 상속해 주는 클래스는 : 부모클래스, 상위클래스
        * - 상속받는 클래스는 : 자식 클래스,하위 클래스
        * - 자식클래스를 선언할 때 extends 라는 키워드를 사용해서 상속받을
        * 클래스를 지정
        *
        * 상속의 장점
        * - 클래스의 간결과, 클래스 관리 용이, 소프트웨어의 생산성 향상
        *
        * 클래스의 간결과 : 멤버의 중복 작성 불필요
        * 클래스 관리 용이 : 클래스들의 계층정 분류
        * 소프트웨어의 생산성 향상 : 클래스 재사용과 확장용이
        *
        * 형식)
        * Class A{
        *       //부모 클래스
        * }
        *
        * Class B extends A{
        *       B 클래스는 A 클래스의 자식 클래스
        *
        * Java 상속의 특징 다중상속이 불가능 하다.
        * */
    }
}
